Revit 2027 API
KeyBasedTreeEntryTable.GetKeyBasedTreeEntries Method
 Gets the KeyBasedTreeEntries for this table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntries GetKeyBasedTreeEntries()
Public Function GetKeyBasedTreeEntries As KeyBasedTreeEntries
public:
KeyBasedTreeEntries^ GetKeyBasedTreeEntries()
member GetKeyBasedTreeEntries : unit -> KeyBasedTreeEntries
Return Value
KeyBasedTreeEntries
 The KeyBasedTreeEntries for this table.
See Also
Reference
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace